# learnPandas

In [2]:
%%javascript
// JAVASCRIPT CONETENTS
setTimeout(function(){
$(":header").each(function(i){ 
    var level = this.tagName[1]
    var buffer = ""
    for(var j = 0;j <= level; j++){

        buffer += "  "
    }
    buffer += "- "
    console.log(buffer)
    element.append("<code>"+ buffer + "</code>" + "<a href=#" + this.id + ">" + this.innerText + "</a><br>"); 
})
    },100);

## Resources 

https://pandas.pydata.org/pandas-docs/stable/10min.html

## Basic Data Structures

 - Series
 - DataFrames
 - Panels (collection of DataFrames)

## Imports

In [3]:
import pandas as pd
import numpy as np

## Example Series, Daterange index and Dataframe

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])
dates = pd.date_range('01/01/2017', periods=8,freq='D')
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])

### Create from Dictionary
df2 = pd.DataFrame({"A":1,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo'
                   })

## Inspecting DataFrame

### head

In [5]:
df.head(n=2)

                   A         B         C         D
2017-01-01  1.090135 -0.689298 -0.493380 -1.266129
2017-01-02 -0.495245 -1.130409 -0.784152 -1.971266

### tail

In [6]:
df.tail(n=1)

                   A         B         C         D
2017-01-08 -0.030202 -1.016389 -0.023042 -0.061567

### describe

In [7]:
df.describe()

              A         B         C         D
count  8.000000  8.000000  8.000000  8.000000
mean   0.235599  0.120467 -0.065856 -0.250859
std    0.675412  1.117830  0.715205  1.383362
min   -0.604122 -1.130409 -0.784152 -1.971266
25%   -0.285482 -0.771071 -0.461599 -1.294694
50%    0.215872 -0.071345 -0.219570 -0.288621
75%    0.682838  0.831775  0.028512  0.185291
max    1.130771  1.727822  1.539788  2.323853

### info

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 8 entries, 2017-01-01 to 2017-01-08
Freq: D
Data columns (total 4 columns):
A    8 non-null float64
B    8 non-null float64
C    8 non-null float64
D    8 non-null float64
dtypes: float64(4)
memory usage: 320.0 bytes

### columns

In [9]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

### index

In [10]:
df.index

#print(xxxxx, end='\n\n',sep="\n")

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08'],
              dtype='datetime64[ns]', freq='D')

 <br>

## Selecting

### Select a Column (series type)

In [11]:
df['A']

2017-01-01    1.090135
2017-01-02   -0.495245
2017-01-03   -0.604122
2017-01-04    1.130771
2017-01-05    0.547072
2017-01-06    0.461945
2017-01-07   -0.215562
2017-01-08   -0.030202
Freq: D, Name: A, dtype: float64

### Select a Row slice

In [12]:
df[1:2]

                   A         B         C         D
2017-01-02 -0.495245 -1.130409 -0.784152 -1.971266

### Select by label - df.loc

In [13]:
# Selecting by multiaxis labels
df.loc[:dates[3],'B':'D']

                   B         C         D
2017-01-01 -0.689298 -0.493380 -1.266129
2017-01-02 -1.130409 -0.784152 -1.971266
2017-01-03  0.032015  0.006502 -1.380387
2017-01-04  0.556200  1.539788  0.925865

In [14]:
# Selecting a row (returns series)
df.loc[dates[3],:]

A    1.130771
B    0.556200
C    1.539788
D    0.925865
Name: 2017-01-04 00:00:00, dtype: float64

### Select by Position - df.iloc

In [15]:
# Select multiple axis position
df.iloc[3:5,2:]

                   C         D
2017-01-04  1.539788  0.925865
2017-01-05 -0.451005 -0.484730

### Boolean indexing

In [16]:
# Select by logical condition
df[df.A > 0]

                   A         B         C         D
2017-01-01  1.090135 -0.689298 -0.493380 -1.266129
2017-01-04  1.130771  0.556200  1.539788  0.925865
2017-01-05  0.547072  1.658501 -0.451005 -0.484730
2017-01-06  0.461945  1.727822  0.094541  2.323853

In [17]:
df.iloc[3:5,2:]

                   C         D
2017-01-04  1.539788  0.925865
2017-01-05 -0.451005 -0.484730

### isin

In [18]:
# Adding a column
df['E'] = [1,2,3,4,5,6,7,8] 
df[df['E'].isin([3,4])]

                   A         B         C         D  E
2017-01-03 -0.604122  0.032015  0.006502 -1.380387  3
2017-01-04  1.130771  0.556200  1.539788  0.925865  4

<br>

## Missing Data

### dropna

In [19]:
df.loc[dates[0]:dates[3],'F'] = 20
df.dropna()

                   A         B         C         D  E     F
2017-01-01  1.090135 -0.689298 -0.493380 -1.266129  1  20.0
2017-01-02 -0.495245 -1.130409 -0.784152 -1.971266  2  20.0
2017-01-03 -0.604122  0.032015  0.006502 -1.380387  3  20.0
2017-01-04  1.130771  0.556200  1.539788  0.925865  4  20.0

### fillna

In [20]:
df.fillna(value=30)
# note - these operations follow an immutable pattern

                   A         B         C         D  E     F
2017-01-01  1.090135 -0.689298 -0.493380 -1.266129  1  20.0
2017-01-02 -0.495245 -1.130409 -0.784152 -1.971266  2  20.0
2017-01-03 -0.604122  0.032015  0.006502 -1.380387  3  20.0
2017-01-04  1.130771  0.556200  1.539788  0.925865  4  20.0
2017-01-05  0.547072  1.658501 -0.451005 -0.484730  5  30.0
2017-01-06  0.461945  1.727822  0.094541  2.323853  6  30.0
2017-01-07 -0.215562 -0.174704 -0.416099 -0.092512  7  30.0
2017-01-08 -0.030202 -1.016389 -0.023042 -0.061567  8  30.0

### isnull

In [21]:
pd.isnull(df)

                A      B      C      D      E      F
2017-01-01  False  False  False  False  False  False
2017-01-02  False  False  False  False  False  False
2017-01-03  False  False  False  False  False  False
2017-01-04  False  False  False  False  False  False
2017-01-05  False  False  False  False  False   True
2017-01-06  False  False  False  False  False   True
2017-01-07  False  False  False  False  False   True
2017-01-08  False  False  False  False  False   True

## Reshaping

### Dropping column

In [22]:
# make a silly column
df[dates[0],'A']  = 4

In [23]:
df

,A,B,C,D,E,F,"(2017-01-01 00:00:00, A)"
2017-01-01,1.090135,-0.689298,-0.493380,-1.266129,1,20.0,4
2017-01-02,-0.495245,-1.130409,-0.784152,-1.971266,2,20.0,4
2017-01-03,-0.604122,0.032015,0.006502,-1.380387,3,20.0,4
2017-01-04,1.130771,0.556200,1.539788,0.925865,4,20.0,4
2017-01-05,0.547072,1.658501,-0.451005,-0.484730,5,NaN,4
2017-01-06,0.461945,1.727822,0.094541,2.323853,6,NaN,4
2017-01-07,-0.215562,-0.174704,-0.416099,-0.092512,7,NaN,4
2017-01-08,-0.030202,-1.016389,-0.023042,-0.061567,8,NaN,4

In [24]:
# remove the silly column
df.drop(labels=df.columns[5],axis=1,inplace=True)

<br>

## Sorting

### Sort Using sort_index note inplace default is false

In [25]:
df.T

,2017-01-01 00:00:00,2017-01-02 00:00:00,2017-01-03 00:00:00,2017-01-04 00:00:00,2017-01-05 00:00:00,2017-01-06 00:00:00,2017-01-07 00:00:00,2017-01-08 00:00:00
A,1.090135,-0.495245,-0.604122,1.130771,0.547072,0.461945,-0.215562,-0.030202
B,-0.689298,-1.130409,0.032015,0.556200,1.658501,1.727822,-0.174704,-1.016389
C,-0.493380,-0.784152,0.006502,1.539788,-0.451005,0.094541,-0.416099,-0.023042
D,-1.266129,-1.971266,-1.380387,0.925865,-0.484730,2.323853,-0.092512,-0.061567
E,1.000000,2.000000,3.000000,4.000000,5.000000,6.000000,7.000000,8.000000
"(2017-01-01 00:00:00, A)",4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000

### Sort by Columns

In [26]:
df.sort_index(axis=0, ascending=False)

,A,B,C,D,E,"(2017-01-01 00:00:00, A)"
2017-01-08,-0.030202,-1.016389,-0.023042,-0.061567,8,4
2017-01-07,-0.215562,-0.174704,-0.416099,-0.092512,7,4
2017-01-06,0.461945,1.727822,0.094541,2.323853,6,4
2017-01-05,0.547072,1.658501,-0.451005,-0.484730,5,4
2017-01-04,1.130771,0.556200,1.539788,0.925865,4,4
2017-01-03,-0.604122,0.032015,0.006502,-1.380387,3,4
2017-01-02,-0.495245,-1.130409,-0.784152,-1.971266,2,4
2017-01-01,1.090135,-0.689298,-0.493380,-1.266129,1,4

### Sort by index column

In [27]:
df.sort_index(axis=0, ascending=False)

,A,B,C,D,E,"(2017-01-01 00:00:00, A)"
2017-01-08,-0.030202,-1.016389,-0.023042,-0.061567,8,4
2017-01-07,-0.215562,-0.174704,-0.416099,-0.092512,7,4
2017-01-06,0.461945,1.727822,0.094541,2.323853,6,4
2017-01-05,0.547072,1.658501,-0.451005,-0.484730,5,4
2017-01-04,1.130771,0.556200,1.539788,0.925865,4,4
2017-01-03,-0.604122,0.032015,0.006502,-1.380387,3,4
2017-01-02,-0.495245,-1.130409,-0.784152,-1.971266,2,4
2017-01-01,1.090135,-0.689298,-0.493380,-1.266129,1,4

### Sort by values

In [28]:
df.sort_values(by='B',ascending=False,axis=0)

,A,B,C,D,E,"(2017-01-01 00:00:00, A)"
2017-01-06,0.461945,1.727822,0.094541,2.323853,6,4
2017-01-05,0.547072,1.658501,-0.451005,-0.484730,5,4
2017-01-04,1.130771,0.556200,1.539788,0.925865,4,4
2017-01-03,-0.604122,0.032015,0.006502,-1.380387,3,4
2017-01-07,-0.215562,-0.174704,-0.416099,-0.092512,7,4
2017-01-01,1.090135,-0.689298,-0.493380,-1.266129,1,4
2017-01-08,-0.030202,-1.016389,-0.023042,-0.061567,8,4
2017-01-02,-0.495245,-1.130409,-0.784152,-1.971266,2,4

## Edit column width for Long Strings

In [29]:
pd.set_option('display.max_colwidth', 200)

pd.DataFrame({"Long String":"""Lorem ipsum dolor sit amet, consectetur adipiscing elit. 
Morbi sed tincidunt massa. Praesent iaculis molestie accumsan. 
Curabitur ac arcu sit amet nisi porta commodo. Praesent vel cursus urna. 
Nulla velit ante, laoreet ut velit sit amet, faucibus congue mi."""},index=range(1))

                                                                                                                                                                                               Long String
0  Lorem ipsum dolor sit amet, consectetur adipiscing elit. \nMorbi sed tincidunt massa. Praesent iaculis molestie accumsan. \nCurabitur ac arcu sit amet nisi porta commodo. Praesent vel cursus urna....

In [30]:
pd.set_option('display.max_colwidth', 50) # Default

pd.DataFrame({"Long String":"""Lorem ipsum dolor sit amet, consectetur adipiscing elit. 
Morbi sed tincidunt massa. Praesent iaculis molestie accumsan. 
Curabitur ac arcu sit amet nisi porta commodo. Praesent vel cursus urna. 
Nulla velit ante, laoreet ut velit sit amet, faucibus congue mi."""},index=range(1))

                                         Long String
0  Lorem ipsum dolor sit amet, consectetur adipis...

## Creating DataFrame from .csv

### load csv

In [33]:
df3 = pd.read_csv('example_csv.csv')

In [37]:
%%bash
pip3 install progressbar2

Collecting progressbar2
  Using cached https://files.pythonhosted.org/packages/16/68/adc395e0a3c86571081c8a2e2daaa5b58270f6854276a089a0e9b5fa2c33/progressbar2-3.47.0-py2.py3-none-any.whl
Collecting python-utils>=2.3.0 (from progressbar2)
  Using cached https://files.pythonhosted.org/packages/eb/a0/19119d8b7c05be49baf6c593f11c432d571b70d805f2fe94c0585e55e4c8/python_utils-2.3.0-py2.py3-none-any.whl
Requirement already satisfied: six in /usr/local/lib/python3.7/site-packages (from progressbar2) (1.12.0)
Installing collected packages: python-utils, progressbar2
Successfully installed progressbar2-3.47.0 python-utils-2.3.0

In [38]:
import progressbar
bar = progressbar.ProgressBar(widgets=[progressbar.Bar('=','{',"}"), progressbar.Percentage()])
for i in bar(range(800000)):
    bar.update(i+1)

{=========================================================================}100%

### Pivot data dataframe

In [39]:
import pandas as pd
import numpy as np
import random
from datetime import datetime
from dateutil.relativedelta import relativedelta

# First we create example dataframe
r = random.Random(12)


def generate_random_date_in_last_year():
    return (datetime.now() - relativedelta(days=365 * random.random())).date()


dataframe = pd.DataFrame({
    "date_time": [generate_random_date_in_last_year() for _ in range(10)],
    "animal": ['zebra', 'zebra', 'zebra', 'zebra', 'lion', 'lion', 'lion',
               'lion', 'rhino', 'rhino', ],
    "category": ['stripy'] * 4 + ['dangerous'] * 6,
    "name": ['Walter', 'Edmund', 'Gyles', 'John', 'Bartholomew', 'Frederyk',
             'Raulf', 'Symond', 'Carlos', 'Arthur'],
    "weight": [80 + 40 * r.random() for _ in range(10)],
    "favourite_integer": [r.randint(0, 100) for _ in range(10)],
    "bad_column": ['', 3, '', 1, None, 2, 23, 2, 3, 3],
    'employed': [bool(r.randint(0, 1)) for i in range(10)]
})
dataframe.replace(to_replace='', value=np.nan, inplace=True)

# Pivot table
pivot_dataframe = pd.pivot_table(dataframe,
                                 values=['weight', 'bad_column'],
                                 index='animal',
                                 columns='employed',
                                 aggfunc=[np.mean])
pivot_dataframe
#          | mean       | mean       | mean               | mean
#          | bad_column | bad_column | weight             | weight
# employed | False      | True       | False              | True
# animal   |            |            |                    |
# lion     | 9.0        |            | 99.45534245035707  | 80.43441772360272
# rhino    | 3.0        |            | 105.84099383532836 |
# zebra    | 3.0        | 1.0        | 103.97938203294188 | 85.70401411701471

               mean
         bad_column            weight
employed      False True        False      True
animal
lion            9.0   NaN   99.455342  80.434418
rhino           3.0   NaN  105.840994        NaN
zebra           3.0   1.0  103.979382  85.704014

In [40]:
# pivot_dataframe.to_clipboard(sep='|')

### Filter df by list

In [41]:
filter_list = ['lion','rhino']
dataframe[dataframe['animal'].isin(filter_list)]

,date_time,animal,category,name,weight,favourite_integer,bad_column,employed
4,2019-02-07,lion,dangerous,Bartholomew,80.434418,18,NaN,True
5,2019-06-11,lion,dangerous,Frederyk,94.990180,56,2.0,False
6,2019-01-28,lion,dangerous,Raulf,90.961926,47,23.0,False
7,2019-04-10,lion,dangerous,Symond,112.413922,20,2.0,False
8,2019-08-14,rhino,dangerous,Carlos,107.623706,43,3.0,False
9,2019-09-12,rhino,dangerous,Arthur,104.058282,26,3.0,False

In [42]:
dataframe[dataframe['animal'].map(lambda x: x in filter_list)]

,date_time,animal,category,name,weight,favourite_integer,bad_column,employed
4,2019-02-07,lion,dangerous,Bartholomew,80.434418,18,NaN,True
5,2019-06-11,lion,dangerous,Frederyk,94.990180,56,2.0,False
6,2019-01-28,lion,dangerous,Raulf,90.961926,47,23.0,False
7,2019-04-10,lion,dangerous,Symond,112.413922,20,2.0,False
8,2019-08-14,rhino,dangerous,Carlos,107.623706,43,3.0,False
9,2019-09-12,rhino,dangerous,Arthur,104.058282,26,3.0,False

In [43]:
dataframe.query('animal in '+ str(filter_list))

,date_time,animal,category,name,weight,favourite_integer,bad_column,employed
4,2019-02-07,lion,dangerous,Bartholomew,80.434418,18,NaN,True
5,2019-06-11,lion,dangerous,Frederyk,94.990180,56,2.0,False
6,2019-01-28,lion,dangerous,Raulf,90.961926,47,23.0,False
7,2019-04-10,lion,dangerous,Symond,112.413922,20,2.0,False
8,2019-08-14,rhino,dangerous,Carlos,107.623706,43,3.0,False
9,2019-09-12,rhino,dangerous,Arthur,104.058282,26,3.0,False

In [44]:
dataframe[~dataframe['animal'].isin(filter_list)]

,date_time,animal,category,name,weight,favourite_integer,bad_column,employed
0,2019-02-13,zebra,stripy,Walter,98.982827,71,NaN,False
1,2019-07-28,zebra,stripy,Edmund,106.298900,0,3.0,False
2,2020-01-03,zebra,stripy,Gyles,106.656419,84,NaN,False
3,2019-08-17,zebra,stripy,John,85.704014,79,1.0,True

### aggregations

In [45]:
"""
Section:
    Pandas

Author:
    Simon Ward-Jones

Description:
    Dataframe aggregations

Tags:
    pandas , aggregate, sum, mean
"""
import pandas as pd
import numpy as np
import random
from datetime import datetime
from dateutil.relativedelta import relativedelta

# First we create example dataframe
r = random.Random(12)


def generate_random_date_in_last_year():
    return (datetime.now() - relativedelta(days=365 * random.random()))


dataframe = pd.DataFrame({
    "date_time": [generate_random_date_in_last_year() for _ in range(10)],
    "animal": ['zebra', 'zebra', 'zebra', 'zebra', 'lion', 'lion', 'lion',
               'lion', 'rhino', 'rhino', ],
    "category": ['stripy'] * 4 + ['dangerous'] * 6,
    "name": ['Walter', 'Edmund', 'Gyles', 'John', 'Bartholomew', 'Frederyk',
             'Raulf', 'Symond', 'Carlos', 'Arthur'],
    "weight": [80 + 40 * r.random() for _ in range(10)],
    "favourite_integer": [r.randint(0, 100) for _ in range(10)],
    "bad_column": ['', 3, '', 1, None, 2, 23, 2, 3, 3],
    'employed': [bool(r.randint(0, 1)) for i in range(10)]
})
dataframe.replace(to_replace='', value=np.nan, inplace=True)
dataframe

dataframe_stats = dataframe.groupby(['animal','employed']).agg({
    'favourite_integer': ['min', 'max', 'mean', 'std', 'sum'],
    'weight':['sum']});
animal_weight_stats = dataframe_stats['weight'].sort_values('sum', ascending=False);

In [46]:
# animal_weight_stats.to_clipboard(sep='|')

### dataframe time

In [47]:
"""
Section:
    Pandas

Author:
    Simon Ward-Jones

Description:
    Dataframe datetime

Tags:
    pandas , datetime, timestamp
"""
import pandas as pd
import numpy as np
import random
from datetime import datetime
from dateutil.relativedelta import relativedelta

# First we create example dataframe
r = random.Random(12)


def generate_random_date_in_last_year():
    return (datetime.now() - relativedelta(days=365 * random.random()))


dataframe = pd.DataFrame({
    "date_time": [generate_random_date_in_last_year() for _ in range(10)]})
dataframe['month']       = dataframe.date_time.dt.month
dataframe['day']         = dataframe.date_time.dt.day
dataframe['hour']        = dataframe.date_time.dt.hour
dataframe['minute']      = dataframe.date_time.dt.minute
dataframe['day_of_week'] = dataframe.date_time.dt.dayofweek
dataframe

                   date_time  month  day  hour  minute  day_of_week
0 2019-03-03 22:34:17.122425      3    3    22      34            6
1 2019-10-18 09:22:44.849419     10   18     9      22            4
2 2019-03-15 03:49:21.409738      3   15     3      49            4
3 2019-06-08 05:41:02.863719      6    8     5      41            5
4 2019-05-25 07:46:37.366430      5   25     7      46            5
5 2019-07-29 18:16:37.359513      7   29    18      16            0
6 2019-04-14 18:36:27.086240      4   14    18      36            6
7 2019-04-17 16:08:30.966033      4   17    16       8            2
8 2019-12-13 16:00:23.223950     12   13    16       0            4
9 2019-02-03 21:45:29.410253      2    3    21      45            6

In [48]:
dataframe.to_clipboard(sep='|')

### Index a value in a dataframe

In [49]:
"""
Section:
    Pandas

Author:
    Simon Ward-Jones

Description:
    Dataframe indexing

Tags:
    pandas , index, lookup
"""
import pandas as pd
import numpy as np
import random
from datetime import datetime
from dateutil.relativedelta import relativedelta

# First we create example dataframe
r = random.Random(12)


def generate_random_date_in_last_year():
    return (datetime.now() - relativedelta(days=365 * random.random()))


dataframe = pd.DataFrame({
    "date_time": [generate_random_date_in_last_year() for _ in range(10)],
    "animal": ['zebra', 'zebra', 'zebra', 'zebra', 'lion', 'lion', 'lion',
               'lion', 'rhino', 'rhino', ],
    "category": ['stripy'] * 4 + ['dangerous'] * 6,
    "name": ['Walter', 'Edmund', 'Gyles', 'John', 'Bartholomew', 'Frederyk',
             'Raulf', 'Symond', 'Carlos', 'Arthur'],
    "weight": [80 + 40 * r.random() for _ in range(10)],
    "favourite_integer": [r.randint(0, 100) for _ in range(10)],
    "bad_column": ['', 3, '', 1, None, 2, 23, 2, 3, 3],
    'employed': [bool(r.randint(0, 1)) for i in range(10)]
})
dataframe.replace(to_replace='', value=np.nan, inplace=True)

# How to get the value in row zero in the 'name' column

idx = 0

# All the below give the same result

# Using .loc to select row and column
dataframe.loc[idx,'name']
# 'Walter'

# Select the row then name 
# Use .iloc to select a row series and then select name entry
dataframe.iloc[idx]['name']
# 'Walter'

# Select the column series and then select the idx entry
dataframe['name'][idx]
# 'Walter'

# Same but with dot notation
dataframe.name[idx]
# 'Walter'

'Walter'

In [50]:
idx = 0

# All the below give the same result

# Using .loc to select row and column
dataframe.loc[idx,'name']
# 'Walter'

# Select the row then name 
# Use .iloc to select a row series and then select name entry
dataframe.iloc[idx]['name']
# 'Walter'

# select the column series and then select the idx entry
dataframe['name'][idx]
# 'Walter'

# same but with dot notation
dataframe.name[idx]
# 'Walter'

'Walter'